---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystem
source: html/7e9912ae-887e-1849-ba58-6460ed6f1117.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystem Property

"System Color Schemes"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSchemaSettingForSystem { get; }
```